espruino/Espruino/targets/nrf52/jshardware.c
/*
 * This file is part of Espruino, a JavaScript interpreter for Microcontrollers
 *
 * Copyright (C) 2013 Gordon Williams <gw@pur3.co.uk>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 *
 * ----------------------------------------------------------------------------
 * Platform Specific part of Hardware interface Layer
 * ----------------------------------------------------------------------------
 */
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>

#include "jshardware.h"
#include "jstimer.h"
#include "jsutils.h"
#include "jsparse.h"
#include "jsinteractive.h"
#include "jswrap_io.h"
#include "jswrap_date.h" // for non-F1 calendar -> days since 1970 conversion

#ifdef BLE_INTERFACE

  #include "nordic_common.h"
  #include "nrf.h"
  #include "ble_hci.h"
  #include "ble_advdata.h"
  #include "ble_advertising.h"
  #include "ble_conn_params.h"
  #include "softdevice_handler.h"
  #include "app_timer.h"
  #include "app_button.h"
  #include "ble_nus.h"
  #include "app_uart.h"
  #include "app_util_platform.h"
  #include "bsp.h"
  #include "bsp_btn_ble.h"

  #define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                           /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

  #define DEVICE_NAME                     "Nordic_UART"                               /**< Name of device. Will be included in the advertising data. */
  #define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

  #define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
  #define APP_ADV_TIMEOUT_IN_SECONDS      180                                         /**< The advertising timeout (in units of seconds). */

  #define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */
  #define APP_TIMER_MAX_TIMERS            (2 + BSP_APP_TIMERS_NUMBER)                 /**< Maximum number of simultaneously created timers. */
  #define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues. */

  #define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
  #define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
  #define SLAVE_LATENCY                   0                                           /**< Slave latency. */
  #define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
  #define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
  #define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
  #define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

  #define START_STRING                    "Start...\n"                                /**< The string that will be sent over the UART when the application starts. */

  #define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

  #define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
  #define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */

  static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
  static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

  static ble_uuid_t                       m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};  /**< Universally unique service identifier. */


  /**@brief Function for assert macro callback.
   *
   * @details This function will be called in case of an assert in the SoftDevice.
   *
   * @warning This handler is an example only and does not fit a final product. You need to analyse 
   *          how your product is supposed to react in case of Assert.
   * @warning On assert from the SoftDevice, the system can only recover on reset.
   *
   * @param[in] line_num    Line number of the failing ASSERT call.
   * @param[in] p_file_name File name of the failing ASSERT call.
   */
  void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
  {
      app_error_handler(DEAD_BEEF, line_num, p_file_name);
  }


  /**@brief Function for the GAP initialization.
   *
   * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of 
   *          the device. It also sets the permissions and appearance.
   */
  static void gap_params_init(void)
  {
      uint32_t                err_code;
      ble_gap_conn_params_t   gap_conn_params;
      ble_gap_conn_sec_mode_t sec_mode;

      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
      
      err_code = sd_ble_gap_device_name_set(&sec_mode,
                                            (const uint8_t *) DEVICE_NAME,
                                            strlen(DEVICE_NAME));
      APP_ERROR_CHECK(err_code);

      memset(&gap_conn_params, 0, sizeof(gap_conn_params));

      gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
      gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
      gap_conn_params.slave_latency     = SLAVE_LATENCY;
      gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

      err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
      APP_ERROR_CHECK(err_code);
  }


  /**@brief Function for handling the data from the Nordic UART Service.
   *
   * @details This function will process the data received from the Nordic UART BLE Service and send
   *          it to the UART module.
   *
   * @param[in] p_nus    Nordic UART Service structure.
   * @param[in] p_data   Data to be send to UART module.
   * @param[in] length   Length of the data.
   */
  /**@snippet [Handling the data received over BLE] */
  static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
  {
      uint32_t i;

      for (i = 0; i < length; i++)
      {
          while(app_uart_put(p_data[i]) != NRF_SUCCESS);
      }
      while(app_uart_put('\n') != NRF_SUCCESS);
  }
  /**@snippet [Handling the data received over BLE] */


  /**@brief Function for initializing services that will be used by the application.
   */
  static void services_init(void)
  {
      uint32_t       err_code;
      ble_nus_init_t nus_init;
      
      memset(&nus_init, 0, sizeof(nus_init));

      nus_init.data_handler = nus_data_handler;
      
      err_code = ble_nus_init(&m_nus, &nus_init);
      APP_ERROR_CHECK(err_code);
  }


  /**@brief Function for handling an event from the Connection Parameters Module.
   *
   * @details This function will be called for all events in the Connection Parameters Module
   *          which are passed to the application.
   *
   * @note All this function does is to disconnect. This could have been done by simply setting
   *       the disconnect_on_fail config parameter, but instead we use the event handler
   *       mechanism to demonstrate its use.
   *
   * @param[in] p_evt  Event received from the Connection Parameters Module.
   */
  static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
  {
      uint32_t err_code;
      
      if(p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
      {
          err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
          APP_ERROR_CHECK(err_code);
      }
  }


  /**@brief Function for handling errors from the Connection Parameters module.
   *
   * @param[in] nrf_error  Error code containing information about what went wrong.
   */
  static void conn_params_error_handler(uint32_t nrf_error)
  {
      APP_ERROR_HANDLER(nrf_error);
  }


  /**@brief Function for initializing the Connection Parameters module.
   */
  static void conn_params_init(void)
  {
      uint32_t               err_code;
      ble_conn_params_init_t cp_init;
      
      memset(&cp_init, 0, sizeof(cp_init));

      cp_init.p_conn_params                  = NULL;
      cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
      cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
      cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
      cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
      cp_init.disconnect_on_fail             = false;
      cp_init.evt_handler                    = on_conn_params_evt;
      cp_init.error_handler                  = conn_params_error_handler;
      
