espruino/Espruino/targets/nrf52/jshardware.c
      err_code = ble_conn_params_init(&cp_init);
      APP_ERROR_CHECK(err_code);
  }


  /**@brief Function for putting the chip into sleep mode.
   *
   * @note This function will not return.
   */
  static void sleep_mode_enter(void)
  {
      uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
      APP_ERROR_CHECK(err_code);

      // Prepare wakeup buttons.
      err_code = bsp_btn_ble_sleep_mode_prepare();
      APP_ERROR_CHECK(err_code);

      // Go to system-off mode (this function will not return; wakeup will cause a reset).
      err_code = sd_power_system_off();
      APP_ERROR_CHECK(err_code);
  }


  /**@brief Function for handling advertising events.
   *
   * @details This function will be called for advertising events which are passed to the application.
   *
   * @param[in] ble_adv_evt  Advertising event.
   */
  static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
  {
      uint32_t err_code;

      switch (ble_adv_evt)
      {
          case BLE_ADV_EVT_FAST:
              err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
              APP_ERROR_CHECK(err_code);
              break;
          case BLE_ADV_EVT_IDLE:
              sleep_mode_enter();
              break;
          default:
              break;
      }
  }


  /**@brief Function for the Application's S110 SoftDevice event handler.
   *
   * @param[in] p_ble_evt S110 SoftDevice event.
   */
  static void on_ble_evt(ble_evt_t * p_ble_evt)
  {
      uint32_t                         err_code;
      
      switch (p_ble_evt->header.evt_id)
      {
          case BLE_GAP_EVT_CONNECTED:
              err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
              APP_ERROR_CHECK(err_code);
              m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
              break;
              
          case BLE_GAP_EVT_DISCONNECTED:
              err_code = bsp_indication_set(BSP_INDICATE_IDLE);
              APP_ERROR_CHECK(err_code);
              m_conn_handle = BLE_CONN_HANDLE_INVALID;
              break;

          case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
              // Pairing not supported
              err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
              APP_ERROR_CHECK(err_code);
              break;

          case BLE_GATTS_EVT_SYS_ATTR_MISSING:
              // No system attributes have been stored.
              err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
              APP_ERROR_CHECK(err_code);
              break;

          default:
              // No implementation needed.
              break;
      }
  }


  /**@brief Function for dispatching a S110 SoftDevice event to all modules with a S110 SoftDevice 
   *        event handler.
   *
   * @details This function is called from the S110 SoftDevice event interrupt handler after a S110 
   *          SoftDevice event has been received.
   *
   * @param[in] p_ble_evt  S110 SoftDevice event.
   */
  static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
  {
      ble_conn_params_on_ble_evt(p_ble_evt);
      ble_nus_on_ble_evt(&m_nus, p_ble_evt);
      on_ble_evt(p_ble_evt);
      ble_advertising_on_ble_evt(p_ble_evt);
      bsp_btn_ble_on_ble_evt(p_ble_evt);
      
  }


  /**@brief Function for the S110 SoftDevice initialization.
   *
   * @details This function initializes the S110 SoftDevice and the BLE event interrupt.
   */
  static void ble_stack_init(void)
  {
      uint32_t err_code;
      
      // Initialize SoftDevice.
      SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, NULL);

      // Enable BLE stack.
      ble_enable_params_t ble_enable_params;
      memset(&ble_enable_params, 0, sizeof(ble_enable_params));
  #if (defined(S130) || defined(S132))
      ble_enable_params.gatts_enable_params.attr_tab_size   = BLE_GATTS_ATTR_TAB_SIZE_DEFAULT;
  #endif
      ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
      err_code = sd_ble_enable(&ble_enable_params);
      APP_ERROR_CHECK(err_code);
      
      // Subscribe for BLE events.
      err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
      APP_ERROR_CHECK(err_code);
  }


  /**@brief Function for handling events from the BSP module.
   *
   * @param[in]   event   Event generated by button press.
   */
  void bsp_event_handler(bsp_event_t event)
  {
      uint32_t err_code;
      switch (event)
      {
          case BSP_EVENT_SLEEP:
              sleep_mode_enter();
              break;

          case BSP_EVENT_DISCONNECT:
              err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
              if (err_code != NRF_ERROR_INVALID_STATE)
              {
                  APP_ERROR_CHECK(err_code);
              }
              break;

          case BSP_EVENT_WHITELIST_OFF:
              err_code = ble_advertising_restart_without_whitelist();
              if (err_code != NRF_ERROR_INVALID_STATE)
              {
                  APP_ERROR_CHECK(err_code);
              }
              break;

          default:
              break;
      }
  }


  /**@brief   Function for handling app_uart events.
   *
   * @details This function will receive a single character from the app_uart module and append it to 
   *          a string. The string will be be sent over BLE when the last character received was a 
   *          'new line' i.e '\n' (hex 0x0D) or if the string has reached a length of 
   *          @ref NUS_MAX_DATA_LENGTH.
   */
  /**@snippet [Handling the data received over UART] */
  void uart_event_handle(app_uart_evt_t * p_event)
  {
      static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
      static uint8_t index = 0;
      uint32_t       err_code;

      switch (p_event->evt_type)
      {
          case APP_UART_DATA_READY:
              UNUSED_VARIABLE(app_uart_get(&data_array[index]));
              index++;

              if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
              {
                  err_code = ble_nus_string_send(&m_nus, data_array, index);
                  if (err_code != NRF_ERROR_INVALID_STATE)
                  {
                      APP_ERROR_CHECK(err_code);
                  }
                  
                  index = 0;
              }
              break;

          case APP_UART_COMMUNICATION_ERROR:
              APP_ERROR_HANDLER(p_event->data.error_communication);
              break;

          case APP_UART_FIFO_ERROR:
              APP_ERROR_HANDLER(p_event->data.error_code);
              break;

          default:
              break;
      }
  }
  /**@snippet [Handling the data received over UART] */


