espruino/Espruino/targets/nrf52/jshardware.c
  /**@brief  Function for initializing the UART module.
   */
  /**@snippet [UART Initialization] */
  static void uart_init(void)
  {
      uint32_t                     err_code;
      const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_ENABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud38400
      };

      APP_UART_FIFO_INIT( &comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_event_handle,
                         APP_IRQ_PRIORITY_LOW,
                         err_code);
      APP_ERROR_CHECK(err_code);
  }
  /**@snippet [UART Initialization] */


  /**@brief Function for initializing the Advertising functionality.
   */
  static void advertising_init(void)
  {
      uint32_t      err_code;
      ble_advdata_t advdata;
      ble_advdata_t scanrsp;

      // Build advertising data struct to pass into @ref ble_advertising_init.
      memset(&advdata, 0, sizeof(advdata));
      advdata.name_type          = BLE_ADVDATA_FULL_NAME;
      advdata.include_appearance = false;
      advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

      memset(&scanrsp, 0, sizeof(scanrsp));
      scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
      scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

      ble_adv_modes_config_t options = {0};
      options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
      options.ble_adv_fast_interval = APP_ADV_INTERVAL;
      options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

      err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
      APP_ERROR_CHECK(err_code);
  }


  /**@brief Function for initializing buttons and leds.
   *
   * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
   */
  static void buttons_leds_init(bool * p_erase_bonds)
  {
      bsp_event_t startup_event;

      uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                   APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                   bsp_event_handler);
      APP_ERROR_CHECK(err_code);

      err_code = bsp_btn_ble_init(NULL, &startup_event);
      APP_ERROR_CHECK(err_code);

      *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
  }


  /**@brief Function for placing the application in low power state while waiting for events.
   */
  static void power_manage(void)
  {
      uint32_t err_code = sd_app_evt_wait();
      APP_ERROR_CHECK(err_code);
  }

#else // not BLE_INTERFACE

  // These files are needed for non blocking UART to occur.
  #include "app_uart.h"
  #include "app_error.h"
  #include "nrf_delay.h"
  #include "nrf.h"
  #include "bsp.h"

  // These files are needed for the timer.
  #include "nrf_drv_timer.h"

  // For debugging with LEDS.
  #include "nrf_gpio.h"
  #define LED_1 17
  #define LED_2 18
  #define LED_3 19
  #define LED_4 20
  
  #define MAX_TEST_DATA_BYTES (15U)
  #define UART_TX_BUF_SIZE 64                         /**< UART TX buffer size. */
  #define UART_RX_BUF_SIZE 32                         /**< UART RX buffer size. */

  static int init = 0; // Temp hack to get jsiOneSecAfterStartup() going.

  // UART callback function. Registered in uart_init(). Allows to asychronously read characters from UART.
  void uart_event_handle(app_uart_evt_t * p_event)
  {
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
      APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
      APP_ERROR_HANDLER(p_event->data.error_code);
    }
    else if (p_event->evt_type == APP_UART_DATA_READY) // There is one byte in the RX FIFO.
    {
      uint8_t character;
      while(app_uart_get(&character) != NRF_SUCCESS); // Non blocking.
      jshPushIOCharEvent(EV_SERIAL1, (char) character);
    }
  }

  // Initialzes non blocking serial communication with terminal via uart. Returns 0 on success, -1 on an error.
  int uart_init()
  {
    uint32_t err_code;

    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        UART_PIN_DISCONNECTED,
        UART_PIN_DISCONNECTED,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud38400
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);

    APP_ERROR_CHECK(err_code);

    if (err_code != NRF_SUCCESS)
    {
      return -1;
    }
    return 0;
  }

#endif // BLE_INTERFACE

// Now implement the Espruino HAL API...
void jshInit() {
  jshInitDevices();
  JshUSARTInfo inf;
  jshUSARTSetup(EV_SERIAL1, &inf); // Initialze UART. jshUSARTSetup() gets called each time a UART needs initializing (and is passed baude rate etc...).
  init = 1;
}

// When 'reset' is called - we try and put peripherals back to their power-on state
void jshReset() {

}

void jshKill() {

}

// stuff to do on idle
void jshIdle() {

  if (init == 1)
  {
    jsiOneSecondAfterStartup(); // Do this the first time we enter jshIdle() after we have called jshInit() and never again.
    init = 0;
  }
  jshUSARTKick(EV_SERIAL1);

} 

/// Get this IC's serial number. Passed max # of chars and a pointer to write to. Returns # of chars
int jshGetSerialNumber(unsigned char *data, int maxChars) {
  return 0;
}

// is the serial device connected?
bool jshIsUSBSERIALConnected() {
  return false;
} 

/// Get the system time (in ticks)
JsSysTime jshGetSystemTime()
{
  return 0;
}

/// Set the system time (in ticks) - this should only be called rarely as it could mess up things like jsinteractive's timers!
void jshSetSystemTime(JsSysTime time) {

